===================
Simple imports
===================

import add from "math"
import { max, min } from "math"
import defaultFn, { helper1, helper2 } from "utils"

---

(source_file
  (import_statement
    (identifier)
    (string_literal))
  (import_statement
    (destructuring_import
      (identifier)
      (identifier))
    (string_literal))
  (import_statement
    (identifier)
    (destructuring_import
      (identifier)
      (identifier))
    (string_literal)))

===================
Simple exports
===================

let x = 1
let y = 2
export { x, y }

---

(source_file
  (let_assignment
    (identifier)
    (number))
  (let_assignment
    (identifier)
    (number))
  (export_statement
    (identifier)
    (identifier)))

===================
Mixed imports and exports
===================

import { sqrt } from "math"
let square = (x) => x * x
let distance = (x, y) => sqrt(square(x) + square(y))
export { distance }

---

(source_file
  (import_statement
    (destructuring_import
      (identifier))
    (string_literal))
  (let_assignment
    (identifier)
    (function_expression
      (parameter_list
        (identifier))
      (binary_expression
        (identifier)
        (identifier))))
  (let_assignment
    (identifier)
    (function_expression
      (parameter_list
        (identifier)
        (identifier))
      (call_expression
        (identifier)
        (binary_expression
          (call_expression
            (identifier)
            (identifier))
          (call_expression
            (identifier)
            (identifier))))))
  (export_statement
    (identifier)))

===================
Bind imports - single binding
===================

bind add as (number, number) => number from "math"

---

(source_file
  (import_statement
    (identifier)
    (function_type
      (parameter_list_type
        (primitive_type)
        (primitive_type))
      (primitive_type))
    (string_literal)))

===================
Bind imports - destructuring binding
===================

bind { 
  max as (number, number) => number,
  min as (number, number) => number
} from "math"

---

(source_file
  (import_statement
    (binding_import
      (binding_identifier
        (identifier)
        (function_type
          (parameter_list_type
            (primitive_type)
            (primitive_type))
          (primitive_type)))
      (binding_identifier
        (identifier)
        (function_type
          (parameter_list_type
            (primitive_type)
            (primitive_type))
          (primitive_type))))
    (string_literal)))

===================
Bind imports - mixed bindings
===================

bind defaultFn as (string) => string, {
  helper1 as (number) => number,
  helper2 as { x: number, y: number }
} from "utils"

---

(source_file
  (import_statement
    (identifier)
    (function_type
      (parameter_list_type
        (primitive_type))
      (primitive_type))
    (binding_import
      (binding_identifier
        (identifier)
        (function_type
          (parameter_list_type
            (primitive_type))
          (primitive_type)))
      (binding_identifier
        (identifier)
        (record_type
          (record_field
            (identifier)
            (primitive_type))
          (record_field
            (identifier)
            (primitive_type)))))
    (string_literal)))
